app/controllers/todos_controller.rb

  def index
    if params[:tags]
      @tag = Tag.find_by_name(params[:tags])
      @todos = @tag.todos
    else
      @todos = Todo.all(:order => "created_at desc")
---
SELECT * FROM "tags" WHERE ("tags"."name" = 'Learn') LIMIT 1
SELECT "todos".* FROM "todos" INNER JOIN "todo_tags" ON "todos".id = "todo_tags".todo_id WHERE (("todo_tags".tag_id = 2))

  def create
    @todo = Todo.create(params[:todo])
---
INSERT INTO "todos" ("created_at", "title", "updated_at", "complete", "user") VALUES('2010-04-15 09:34:43', NULL, '2010-04-15 09:34:43', NULL, NULL)

  def update
    if @todo.update_attributes(params[:todo])
---
UPDATE "todos" SET "updated_at" = '2010-04-15 10:11:14', "complete" = 't' WHERE "id" = 13

  def destroy
    if @todo.delete
---
DELETE FROM "todos" WHERE ("id" IN (8))

  def find_item
    @todo = Todo.find(params[:id])
---
SELECT * FROM "todos" WHERE ("todos"."id" = 13)